Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
/*
 * USB_Host_Device_Manager.c
 *
 *  Created on: Jun 28, 2024
 *      Author: Jack Herron
 */

#include <stdlib.h>						// include c standard library
#include <stdint.h>						// Include C library for fixed-width integer types
#include <stm32f4xx.h>					// include MCU specific definitions
#include <stdbool.h>

#include "../Inc/USB_Host.h"
#include "../../Config/USB_Host_Config.h"
#include "../Inc/USB_Host_Device_Manager.h"



static USB_Host_Device_Manager___Port_TypeDef  	 USB_Host_Device_Manager___Port[USB_Host___NUMBER_OF_PORTS] = {0};

#if USB_Host_Config___DYNAMICALLY_ALLOCATE_DEVICES == false

	USB_Host_Device_Manager___Device_TypeDef device_Pool[USB_Host_Device_Manager___DEVICE_POOL_SIZE];

	USB_Host_Device_Manager___Device_TypeDef* USB_Host_Device_Manager___Allocate_Device()
	{
		for(uint16_t i = 0; i < USB_Host_Device_Manager___DEVICE_POOL_SIZE; i++)
		{
			if(device_Pool[i].is_Allocated == false)
			{
				device_Pool[i].is_Allocated = true;
				return(&device_Pool[i]);
			}
		}
		return(NULL);
	}

	void USB_Host_Device_Manager___Free_Device(USB_Host_Device_Manager___Device_TypeDef* p_Device)
	{
		p_Device -> is_Allocated = false;
	}

#else

	USB_Host_Device_Manager___Device_TypeDef* USB_Host_Device_Manager___Allocate_Device()
	{
		USB_Host_Device_Manager___Device_TypeDef* p_Device = NULL;

		p_Device = (USB_Host_Device_Manager___Device_TypeDef*)malloc(sizeof(USB_Host_Device_Manager___Device_TypeDef));
		if(p_Device != NULL)
		{
			p_Device -> is_Allocated = true;
		}
		return(p_Device);
	}

	void USB_Host_Device_Manager___Free_Device(USB_Host_Device_Manager___Device_TypeDef* p_Device)
	{
		free(p_Device);
	}

#endif // --------------------------------------------------------------------------------------------------------

USB_Host_Device_Manager___Polling_Device_List_Typedef	USB_Host_Device_Manager___Polling_List[2] = {0};

void USB_Host_Device_Manager___Add_Polling_Device(uint8_t port_Number, uint8_t device_Address, uint16_t polling_Period, void callback(uint8_t port_Number , uint8_t device_Address))
{
	USB_Host_Device_Manager___Polling_Device_Node_TypeDef* p_Polling_Node = &(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->polling_Process);

	if(p_Polling_Node != NULL)
	{
		p_Polling_Node -> enabled														= true;
		p_Polling_Node -> device_Address 												= device_Address;
		p_Polling_Node -> polling_Target 												= polling_Period;
		p_Polling_Node -> polling_Counter 												= 0;
		p_Polling_Node -> callback 														= callback;
		p_Polling_Node -> next_Node														= NULL;
		p_Polling_Node -> previous_Node													= NULL;

		if(USB_Host_Device_Manager___Polling_List->first_Node != NULL)
		{
			p_Polling_Node->previous_Node												= USB_Host_Device_Manager___Polling_List[port_Number].last_Node;
			USB_Host_Device_Manager___Polling_List[port_Number].last_Node -> next_Node 	= p_Polling_Node;
			USB_Host_Device_Manager___Polling_List[port_Number].last_Node 				= p_Polling_Node;
		}
		else
		{
			USB_Host_Device_Manager___Polling_List[port_Number].last_Node 				= p_Polling_Node;
			USB_Host_Device_Manager___Polling_List[port_Number].first_Node 				= p_Polling_Node;
		}
	}
}

void USB_Host_Device___Remove_Polling_Device(uint8_t port_Number, uint8_t device_Address)
{
	USB_Host_Device_Manager___Polling_Device_Node_TypeDef* p_Polling_Node = &(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->polling_Process);
	if(p_Polling_Node != NULL)
	{
		p_Polling_Node -> enabled														= false;
		p_Polling_Node -> device_Address 												= 0;
		p_Polling_Node -> polling_Target 												= 0;
		p_Polling_Node -> polling_Counter 												= 0;
		p_Polling_Node -> callback 														= NULL;

		if(p_Polling_Node == USB_Host_Device_Manager___Polling_List[port_Number].first_Node)
		{
			USB_Host_Device_Manager___Polling_List[port_Number].first_Node = NULL;
		}
		if(p_Polling_Node == USB_Host_Device_Manager___Polling_List[port_Number].last_Node)
		{
			USB_Host_Device_Manager___Polling_List[port_Number].last_Node = p_Polling_Node->previous_Node;
		}

		if(p_Polling_Node -> previous_Node != NULL)
		{
			if(p_Polling_Node -> next_Node != NULL)
			{
				p_Polling_Node->previous_Node -> next_Node 	= p_Polling_Node -> next_Node;
			}
			else
			{
				p_Polling_Node->previous_Node -> next_Node = NULL;
			}
		}
	}
}

void USB_Host_Device_Manager___Device_Add_Disconnection_Callback(uint8_t port_Number, uint8_t device_Address, void callback(uint8_t port_Number, uint8_t device_Address))
{
	USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->callbacks.device_Disconnected_Callback = callback;
}

USB_Host_Device_Manager___Device_TypeDef* USB_Host_Device_Manager___Get_Device_Pointer(uint8_t port_Number, uint8_t device_Address)
{
	return(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]);
}

uint8_t USB_Host_Device_Manager___Is_Port_Open(uint8_t port_Number)
{
	return(USB_Host_Device_Manager___Port[port_Number].p_Device[0] == NULL);
}

uint8_t USB_Host_Device_Manager___Get_Device_Class(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->bDeviceClass);
}

uint16_t USB_Host_Device_Manager___Get_Device_USB_Specification_Number(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->bcdUSB);
}

uint8_t USB_Host_Device_Manager___Get_Device_Subclass(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->bDeviceSubClass);
}

uint8_t USB_Host_Device_Manager___Get_Device_Protocol(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->bDeviceProtocol);
}

uint16_t USB_Host_Device_Manager___Get_Device_Vendor_ID(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->idVendor);
}

