Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
uint16_t USB_Host_Device_Manager___Get_Device_Product_ID(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->idProduct);
}

uint16_t USB_Host_Device_Manager___Get_Device_Release_Number(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->bcdDevice);
}

uint8_t USB_Host_Device_Manager___Get_Device_Current_Configuration(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->status.current_Configuration);
}

USB_Host___Configuration_Descriptor_TypeDef USB_Host_Device_Manager___Device_Get_Configuration_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Index)
{
	return (*USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].p_Configuration_Descriptor);
}

USB_Host___Interface_Descriptor_TypeDef USB_Host_Device_Manager___Device_Get_Interface_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Index, uint8_t interface_Index)
{
	return (*USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[interface_Index].p_Interface_Descriptor);
}

USB_Host___Endpoint_Descriptor_TypeDef USB_Host_Device_Manager___Device_Get_Endpoint_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Index, uint8_t interface_Index, uint8_t endpoint_Index)
{
	return (*USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[interface_Index].endpoint[endpoint_Index].p_Endpoint_Descriptor);
}

uint8_t* USB_Host_Device_Manager___Get_Device_Descriptor_Buffer(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.device_Descriptor_Buffer);
}

uint16_t* USB_Host_Device_Manager___Get_Language_ID_List(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.p_Language_ID_List);
}

uint16_t* USB_Host_Device_Manager___Get_Manufacturer_String(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.p_Manufacturer_String);
}

uint16_t* USB_Host_Device_Manager___Get_Product_String(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.p_Product_String);
}

uint16_t* USB_Host_Device_Manager___Get_Serial_Number_String(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.p_Serial_Number_String);
}

uint8_t USB_Host_Device_Manager___Get_Serial_Number_String_Length(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.serial_Number_String_Length);
}

uint8_t USB_Host_Device_Manager___Get_Manufacturer_String_Length(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.manufacturer_String_Length);
}

uint8_t USB_Host_Device_Manager___Get_Product_String_Length(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.product_String_Length);
}

uint8_t USB_Host_Device_Manager___Get_Language_ID_List_Length(uint8_t port_Number, uint8_t device_Address)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.language_ID_List_Length);
}

uint8_t USB_Host_Device_Manager___Get_String_Descriptor_Length(uint8_t port_Number, uint8_t device_Address, uint8_t string_Type)
{
	switch (string_Type)
	{
	case USB_Host_Device_Manager___STRING_TYPE_LANGUAGE_ID:
	{
		return (USB_Host_Device_Manager___GET_MIN(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.language_ID_Descriptor_Buffer[0], USB_Host_Config___DEVICE_LANGUAGE_ID_STRING_MAX_LENGTH));
	}
	case USB_Host_Device_Manager___STRING_TYPE_MANUFACTURER:
	{
		return (USB_Host_Device_Manager___GET_MIN(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.manufacturer_String_Descriptor_Buffer[0], USB_Host_Config___DEVICE_MANUFACTURER_STRING_MAX_LENGTH));
	}
	case USB_Host_Device_Manager___STRING_TYPE_PRODUCT:
	{
		return (USB_Host_Device_Manager___GET_MIN(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.product_String_Descriptor_Buffer[0], USB_Host_Config___DEVICE_PRODUCT_STRING_MAX_LENGTH));
	}
	case USB_Host_Device_Manager___STRING_TYPE_SERIAL_NUMBER:
	{
		return (USB_Host_Device_Manager___GET_MIN(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.serial_Number_String_Descriptor_Buffer[0], USB_Host_Config___DEVICE_SERIAL_NUMBER_STRING_MAX_LENGTH));
	}
	default:
	{
		return (0);
	}
	}
}

uint16_t USB_Host_Device_Manager___Device_Get_Configuration_Descriptor_Total_Length(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Index)
{
	return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].p_Configuration_Descriptor->wTotalLength);
}

void USB_Host_Device_Manager___Device_Update_Configuration_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Index)
{
	uint16_t total_Length 				= USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].p_Configuration_Descriptor->wTotalLength;
	uint16_t i 							= 0;
	uint8_t interface_Descriptor_Number	= 0;
	uint8_t endpoint_Descriptor_Number  = 0;
	while(i <  total_Length)
	{
		uint8_t descriptor_Type 	= USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.configuration_Descriptor_Buffer[configuration_Index][i+1];
		uint8_t descriptor_Length 	= USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.configuration_Descriptor_Buffer[configuration_Index][i];
		uint8_t* p_Current_Position = &(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.configuration_Descriptor_Buffer[configuration_Index][i]);

		switch (descriptor_Type)
		{
		case USB_Host___CONFIGURATION_DESCRIPTOR_TYPE:
			USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].p_Configuration_Descriptor = (USB_Host___Configuration_Descriptor_TypeDef*)p_Current_Position;
			USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].configuration_Buffer_Index = i;
			break;
		case USB_Host___INTERFACE_DESCRIPTOR_TYPE:
			USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[interface_Descriptor_Number].p_Interface_Descriptor 		= (USB_Host___Interface_Descriptor_TypeDef*)p_Current_Position;
			USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[interface_Descriptor_Number].configuration_Buffer_Index 	= i;
			interface_Descriptor_Number++;
			break;
		case USB_Host___ENDPOINT_DESCRIPTOR_TYPE:
            USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[interface_Descriptor_Number-1].endpoint[endpoint_Descriptor_Number].p_Endpoint_Descriptor 		= (USB_Host___Endpoint_Descriptor_TypeDef*)p_Current_Position;
            USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[interface_Descriptor_Number-1].endpoint[endpoint_Descriptor_Number].configuration_Buffer_Index 	= i;
            endpoint_Descriptor_Number++;
            break;
		}

