Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
void USB_Host_Device_Manager___Clear_Device_Connection_Flag(uint8_t port_Number, uint8_t device_Address)
{
	USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

	if(p_Device != NULL)
	{
		p_Device -> status.connection_Flag = false;
	}
}

void USB_Host_Device_Manager___Device_Set_Port_Number(uint8_t port_Number, uint8_t device_Address)
{
	USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

	if(p_Device != NULL)
	{
		p_Device -> status.port_Number = port_Number;
	}
}

void USB_Host_Device_Manager___Device_Set_Speed(uint8_t port_Number, uint8_t device_Address, uint8_t device_Speed)
{
	USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

	if(p_Device != NULL)
	{
		if(device_Speed == USB_Host_Device_Manager___LOW_SPEED_DEVICE)
		{
			p_Device -> status.is_Low_Speed_Device = 1;
			p_Device -> status.is_High_Speed_Device = 0;
		}
		else if(device_Speed == USB_Host_Device_Manager___HIGH_SPEED_DEVICE)
		{
			p_Device -> status.is_Low_Speed_Device = 0;
			p_Device -> status.is_High_Speed_Device = 1;
		}
		else
		{
			p_Device -> status.is_Low_Speed_Device = 0;
			p_Device -> status.is_High_Speed_Device = 0;
		}
	}
}

uint8_t USB_Host_Device_Manager___Port_Get_Root_Device_Address(uint8_t port_Number)
{
	return(USB_Host_Device_Manager___Port[port_Number].port_Status.root_Device_Address);
}

void USB_Host_Device_Manager___Device_Initialize_Buffers(uint8_t port_Number, uint8_t device_Address)
{
	USB_Host_Device_Manager___Device_TypeDef *p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

	if (p_Device != NULL)
	{
		p_Device -> descriptors.p_Device_Descriptor = (USB_Host___Device_Descriptor_TypeDef*)	(p_Device -> descriptor_Buffers.device_Descriptor_Buffer);
		p_Device -> strings.p_Language_ID_List 		= (uint16_t*)								&(p_Device -> descriptor_Buffers.language_ID_Descriptor_Buffer[2]);
		p_Device -> strings.p_Manufacturer_String 	= (uint16_t*)								&(p_Device -> descriptor_Buffers.manufacturer_String_Descriptor_Buffer[2]);
		p_Device -> strings.p_Product_String 		= (uint16_t*)								&(p_Device -> descriptor_Buffers.product_String_Descriptor_Buffer[2]);
		p_Device -> strings.p_Serial_Number_String 	= (uint16_t*)								&(p_Device -> descriptor_Buffers.serial_Number_String_Descriptor_Buffer[2]);

		p_Device -> strings.product_String_Length		= 0;
		p_Device -> strings.manufacturer_String_Length	= 0;
		p_Device -> strings.serial_Number_String_Length	= 0;
		p_Device -> strings.language_ID_List_Length		= 0;

		for(uint8_t i = 0; i < USB_Host_Config___DEVICE_MAX_NUMBER_OF_CONFIGURATIONS; i++)
		{
			p_Device -> descriptors.configuration[i].p_Configuration_Descriptor = (USB_Host___Configuration_Descriptor_TypeDef*) (p_Device -> descriptor_Buffers.configuration_Descriptor_Buffer[i]);
		}
	}
}

void USB_Host_Device_Manager___Handle_Start_Of_Frame(uint8_t port_Number)
{
	if(USB_Host_Device_Manager___Polling_List->first_Node != NULL)
	{
		USB_Host_Device_Manager___Polling_Device_Node_TypeDef* p_Polling_Node = USB_Host_Device_Manager___Polling_List->first_Node;
		while (p_Polling_Node != NULL)
		{
			p_Polling_Node->polling_Counter++;
			if (p_Polling_Node->polling_Counter >= (p_Polling_Node -> polling_Target))
			{
				p_Polling_Node->polling_Counter = 0;
				p_Polling_Node->callback(port_Number, p_Polling_Node -> device_Address);
			}
			p_Polling_Node = p_Polling_Node->next_Node;
		}
	}
}

void USB_Host_Device_Manager___Device_Initialize_Callbacks(uint8_t port_Number, uint8_t device_Address)
{
	USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

	for(uint8_t i = 0; i < USB_Host_Config___DEVICE_MAX_NUMBER_OF_CONFIGURATIONS; i++)
	{
		for(uint8_t j = 0; j < USB_Host_Config___DEVICE_MAX_NUMBER_OF_INTERFACE_DESCRIPTORS; j++)
		{
			p_Device->callbacks.interface_Disconnected_Callback[i][j] = NULL;
		}
	}

	p_Device->callbacks.device_Enumerated_Callback 		= NULL;
	p_Device->callbacks.device_Disconnected_Callback 	= NULL;
}

void USB_Host_Device_Manager___Setup_Device(uint8_t port_Number, uint8_t device_Address, uint8_t is_Root_Device, uint8_t device_Speed)
{
	USB_Host_Device_Manager___Device_Set_Is_Root_Device							(port_Number, device_Address, is_Root_Device);
	USB_Host_Device_Manager___Device_Initialize_Buffers							(port_Number, device_Address);
	USB_Host_Device_Manager___Device_Initialize_Callbacks						(port_Number, device_Address);
	USB_Host_Device_Manager___Device_Set_Port_Number							(port_Number, 0);
	USB_Host_Device_Manager___Device_Set_Speed									(port_Number, 0, device_Speed);
}

void USB_Host_Device_Manager___Set_Interface_Disconnected_Callback(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Number, uint8_t interface_Number, void callback(uint8_t, uint8_t, uint8_t, uint8_t))
{
	USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];
	p_Device->callbacks.interface_Disconnected_Callback[configuration_Number][interface_Number] = callback;
}

int8_t USB_Host_Device_Manager___Allocate_Device_At_Address_Zero(uint8_t port_Number, uint8_t device_Speed, uint8_t is_Root_Device)
{
	if(USB_Host_Device_Manager___Port[port_Number].p_Device[0] == NULL)
	{
		USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Allocate_Device();
		if(p_Device != NULL)
		{
			if(USB_Host_Device_Manager___Port_Set_Device_To_Address(port_Number, 0, p_Device) == EXIT_SUCCESS)
			{
				USB_Host_Device_Manager___Setup_Device(port_Number, 0, is_Root_Device, device_Speed);

				return(EXIT_SUCCESS);
			}
		}
	}
	return(EXIT_FAILURE);
}

void USB_Host_Device_Manager___Enable_Device(uint8_t port_Number, uint8_t device_Address)
{
	USB_Host_Device_Manager___Device_Connected(port_Number, device_Address);
}
